{"slug":"2024-09-01-test","type":"gdoc","id":"1zC_PSiZo3XL0XUz8qwVVCbm7wIsvkKVf2B8uCwdfau8","pageData":{"blocks":[{"type":"graphic","value":{"graphic":"me"}},{"type":"svelte","value":{"component":"Contact"}},{"type":"h2","value":"About me"},{"type":"text","value":"I write, make graphics, and analyze data for the <a href=\"https://www.nytimes.com/section/upshot\">New York Times Upshot</a> as part of the <a href=\"https://www.nytco.com/careers/newsroom/newsroom-fellowship/2024-25-fellows/\">2024-25 Fellowship Class</a>. I cover politics, sports, pop culture and more. Next year, I’ll be starting my Ph.D. in Political Science at MIT. Broadly, I’m interested in the intersection between political science, public policy, and statistical and computational methods."},{"type":"text","value":"I graduated from Boston University in 2024 with a B.A. in Computer Science and Statistics and a minor in Public Policy Analysis. I’ve interned for data science <a href=\"https://www.trssllc.com/\">research</a> <a href=\"https://www.bu.edu/spark/\">groups</a>, a <a href=\"https://civin.co/\">civic tech startup</a>, and a <a href=\"https://www.mlb.com/phillies\">baseball team</a>. I am also the founder and technical director of <a href=\"https://x.com/UmpScorecards\">Umpire Scorecards</a>."},{"type":"hr","value":""},{"type":"svelte","value":{"component":"EntryList","hed":"Selected NYT work (full list <a href=\"https://www.nytimes.com/by/ethan-singer\">here</a>)","entries":[{"title":"<a href=\"https://www.nytimes.com/interactive/2024/10/30/upshot/voters-moving-polarization.html\">Millions of Movers Reveal American Polarization in Action</a>","byline":"With <a href=\"https://www.nytimes.com/by/ronda-kaysen\">Ronda Kaysen</a> and <a href=\"https://www.nytimes.com/by/rumsey-taylor\">Rumsey Taylor</a>","description":"A detailed look at how — and why — voters who move are widening the gap between blue neighborhoods and red ones.","other":[]},{"title":"<a href=\"https://www.nytimes.com/2024/09/28/upshot/election-forecasting-washington-primary.html\">The Surprising Place Analysts Look to for Election Forecasting</a>","description":"Washington State’s primaries have a record of predicting the national mood, making it a bellwether of sorts."},{"title":"<a href=\"https://www.nytimes.com/2024/07/31/world/americas/venezuela-maduro-election-results.html\">Election Results Presented by Venezuela’s Opposition Suggest Maduro Lost Decisively</a>","description":"The Times analyzed partial voting tallies collected by the opposition. They cast further doubt on Nicolás Maduro’s declared victory."}]}},{"type":"svelte","value":{"component":"EntryList","hed":"Research","subhed":"Working papers","id":"research","entries":[{"title":"<a href=\"https://sites.bu.edu/kleinstein/files/2024/03/Gray_Vote.pdf\">The Gray Vote: How Older Home-Owning Voters Dominate Local Elections</a>","byline":"With Maxwell Palmer, Katherine Einstein, and Ellis Hamilton","year":"2023","description":"Local elections are widely recognized as low turnout affairs compared with their national level counterparts. But, scholars have little systematic national data on the composition of the local electorate, and how compositional disparities may vary by context. In this paper, we use a national voter file to compare turnout in general, midterm, and off-cycle local elections in over 500 cities. We provide novel estimates of turnout gaps by race, age, and homeownership status in local elections, and identify stark inequalities compared with national and state elections. We find sizable turnout gaps both by age and homeownership status at the local levels, far exceeding those in national contests. Turnout disparities by age and homeownership status are twice as large as those between Black and white voters, and are considerably larger in off-cycle contests."},{"title":"Allocating County-Level Absentee Ballots to Precincts","year":"2023","byline":"With Maxwell Palmer"},{"title":"Distributed Representations and Ideological Placements of Members of Congress","year":"2022","byline":"With Spencer Torene and Berk Ekmekci"}]}},{"type":"svelte","value":{"component":"EntryList","hed":"Software","id":"software","entries":[{"title":"<a href=\"https://umpscorecards.com/home/\">Umpire Scorecards</a>","description":"An online platform dedicated to measuring the accuracy, consistency, and favor of MLB umpires.","byline":"With <a href=\"https://www.linkedin.com/in/ethan-schwartz-a628a522b/\">Ethan Schwartz</a>"},{"title":"<a href=\"https://censaurus.readthedocs.io/en/latest/\">censaurus</a>","description":"A comprehensive, feature-rich, and user-oriented Python package that wraps the U.S. Census Bureau’s Data and Geographic APIs."},{"title":"<a href=\"https://github.com/singerep/crec\">crec</a>","description":"A python tool built for retrieving, structuring, and enriching the Congressional Record, the official record of the proceedings of the United States Congress. <b>crec</b> wraps the GovInfo API — a product of the U.S. Government Publishing Office — with an intuitive and powerful API of its own.","byline":"With Spencer Torene and Berk Ekmekci"}]}},{"type":"svelte","value":{"component":"EntryList","hed":"Teaching","id":"teaching","entries":[{"title":"CS 111: Introduction to Computer Science","byline":"Instructor: <a href=\"https://www.bu.edu/cs/profiles/dave-sullivan/\">Dave Sullivan</a>","description":"In Fall ‘23 and Spring ‘24, I independently taught lab sections, hosted office hours, and proctored and graded midterm and final exams."},{"title":"CDS 290/292: Civic Tech Research Design and Toolkit","byline":"Instructor: <a href=\"https://maxwellpalmer.com/\">Maxwell Palmer</a>","description":"In Spring ‘23, I assisted in designing lecture materials and lab assignments, translated R code into python and vice-versa, hosted office hours and graded weekly problem sets and reports."}]}}]}}